
//----Домашнее задание 5. (после 12 урока)----  (Домашнаяя работа по JS - 1) ----//

// 1.Написать программу, которая через prompt считывает число 
// и выводит в консоль число равное 10% от введенного числа

// let number = prompt ("Введите число");
// let result = number / 10;
// console.log ("10% от введёного числа: " + result);


//2. Написать программу, которая получает два числа и выводит наименьшее.

// let number_1 = prompt ("Введите певрое число");
// let number_2 = prompt ("Введите второе число");

// if (number_1 > number_2){
//     console.log ("Меньшее число: " + number_2); 
// }
// else if (number_2 > number_1){
//     console.log ("Меньшее число: " + number_1);
// }
// else {
//     console.log ("Числа равны");
// }

//3. Написать программу, которая считывает через prompt число
// и выводит одно из следующих сообщений: ‘Число меньше 100’,
// ‘Число больше 100’ или ‘Число равно 100’.

// let number = prompt ("Введите число");
// if (number < 100){
//     console.log ("Ваше число меньше 100")
//     }

// else if (number > 100){
//     console.log ("Ваше число больше 100")
// }

// else{
//     console.log ("Ваше число равно 100")
// }


//4. Написать программу, которая запрашивает у пользователя его имя
//и возраст (в годах) и выводит в консоль сообщение ‘Hello, <name>’,
//если пользователь совершеннолетний, или ‘Hi, <name>’,
//если пользователь несовершеннолетний.

// let name = prompt ("Введите Ваше имя");
// let age = prompt ("Введите Ваш возраст");
// if (age < 18) {
//     console.log ("Hi, " + name);
// }

// else {
//     console.log ("Hello, " + name);
// }